Revit 2027 API
BuiltInFailures.GeometryFailures.TooManyFacesEdges Property
 This family instance has too many [Edges and Faces]. Remove unnecessary geometry or split the instance into multiple instances.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TooManyFacesEdges { get; }
Public Shared ReadOnly Property TooManyFacesEdges As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TooManyFacesEdges {
	FailureDefinitionId^ get ();
}
static member TooManyFacesEdges : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeometryFailures Class
Autodesk.Revit.DB Namespace